zkd27712306/ESP32-MC/ESP32-MC-main/src/registries.h
#ifndef H_REGISTRIES
#define H_REGISTRIES

#include <stdint.h>

// 从 Minecraft Java 26.1.2 生成

// 二进制包数据
extern uint8_t registries_bin[4746];
extern uint8_t tags_bin[25560];

extern uint16_t block_palette[256]; // 方块调色板
extern uint8_t network_block_palette[483]; // VarInt 方块调色板
extern uint16_t B_to_I[256]; // 方块到物品
uint8_t I_to_B (uint16_t item); // 物品到方块

// 方块 ID
#define B_air 0
#define B_water 1
#define B_water_1 2
#define B_water_2 3
#define B_water_3 4
#define B_water_4 5
#define B_water_5 6
#define B_water_6 7
#define B_water_7 8
#define B_lava 9
#define B_lava_2 10
#define B_lava_4 11
#define B_lava_6 12
#define B_snowy_grass_block 13
#define B_mud 14
#define B_moss_carpet 15
#define B_oak_slab 16
#define B_stone_slab 17
#define B_cobblestone_slab 18
#define B_composter 19
#define B_coal_block 20
#define B_copper_ore 21
#define B_copper_block 22
#define B_chest 23
#define B_oak_leaves 24
#define B_stone 25
#define B_cobblestone 26
#define B_sandstone 27
#define B_furnace 28
#define B_coal_ore 29
#define B_iron_ore 30
#define B_iron_block 31
#define B_gold_block 32
#define B_diamond_block 33
#define B_redstone_block 34
#define B_gold_ore 35
#define B_redstone_ore 36
#define B_diamond_ore 37
#define B_snow 38
#define B_snow_block 39
#define B_dead_bush 40
#define B_short_grass 41
#define B_torch 42
#define B_lily_pad 43
#define B_oak_sapling 44
#define B_cactus 45
#define B_sand 46
#define B_crafting_table 47
#define B_dirt 48
#define B_grass_block 49
#define B_oak_log 50
#define B_ice 51
#define B_bedrock 52
#define B_granite 53
#define B_polished_granite 54
#define B_diorite 55
#define B_polished_diorite 56
#define B_andesite 57
#define B_polished_andesite 58
#define B_coarse_dirt 59
#define B_podzol 60
#define B_oak_planks 61
#define B_suspicious_sand 62
#define B_red_sand 63
#define B_gravel 64
#define B_suspicious_gravel 65
#define B_nether_gold_ore 66
#define B_stripped_oak_log 67
#define B_oak_wood 68
#define B_stripped_oak_wood 69
#define B_azalea_leaves 70
#define B_flowering_azalea_leaves 71
#define B_sponge 72
#define B_wet_sponge 73
#define B_glass 74
#define B_lapis_ore 75
#define B_lapis_block 76
#define B_dispenser 77
#define B_chiseled_sandstone 78
#define B_cut_sandstone 79
#define B_note_block 80
#define B_white_bed 81
#define B_orange_bed 82
#define B_magenta_bed 83
#define B_light_blue_bed 84
#define B_yellow_bed 85
#define B_lime_bed 86
#define B_pink_bed 87
#define B_gray_bed 88
#define B_light_gray_bed 89
#define B_cyan_bed 90
#define B_purple_bed 91
#define B_blue_bed 92
#define B_brown_bed 93
#define B_green_bed 94
#define B_red_bed 95
#define B_black_bed 96
#define B_powered_rail 97
#define B_detector_rail 98
#define B_sticky_piston 99
#define B_cobweb 100
#define B_fern 101
#define B_bush 102
#define B_short_dry_grass 103
#define B_tall_dry_grass 104
#define B_seagrass 105
#define B_piston 106
#define B_white_wool 107
#define B_orange_wool 108
#define B_magenta_wool 109
#define B_light_blue_wool 110
#define B_yellow_wool 111
#define B_lime_wool 112
#define B_pink_wool 113
#define B_gray_wool 114
#define B_light_gray_wool 115
#define B_cyan_wool 116
#define B_purple_wool 117
#define B_blue_wool 118
#define B_brown_wool 119
#define B_green_wool 120
#define B_red_wool 121
#define B_black_wool 122
#define B_dandelion 123
#define B_golden_dandelion 124
#define B_torchflower 125
#define B_poppy 126
#define B_blue_orchid 127
#define B_allium 128
#define B_azure_bluet 129
#define B_red_tulip 130
#define B_orange_tulip 131
#define B_white_tulip 132
#define B_pink_tulip 133
#define B_oxeye_daisy 134
#define B_cornflower 135
#define B_wither_rose 136
#define B_lily_of_the_valley 137
#define B_brown_mushroom 138
#define B_red_mushroom 139
#define B_bricks 140
#define B_tnt 141
#define B_bookshelf 142
#define B_chiseled_bookshelf 143
#define B_oak_shelf 144
#define B_mossy_cobblestone 145
#define B_obsidian 146
#define B_spawner 147
#define B_creaking_heart 148
#define B_oak_stairs 149
#define B_wheat 150
#define B_farmland 151
#define B_oak_sign 152
#define B_oak_door 153
#define B_ladder 154
#define B_rail 155
#define B_cobblestone_stairs 156
#define B_oak_hanging_sign 157
#define B_lever 158
#define B_stone_pressure_plate 159
#define B_iron_door 160
#define B_oak_pressure_plate 161
#define B_redstone_torch 162
#define B_stone_button 163
#define B_cactus_flower 164
#define B_clay 165
#define B_sugar_cane 166
#define B_jukebox 167
#define B_oak_fence 168
#define B_netherrack 169
#define B_soul_sand 170
#define B_soul_soil 171
#define B_basalt 172
#define B_polished_basalt 173
#define B_soul_torch 174
#define B_copper_torch 175
#define B_glowstone 176
#define B_carved_pumpkin 177
#define B_jack_o_lantern 178
#define B_cake 179
#define B_repeater 180
#define B_oak_trapdoor 181
#define B_stone_bricks 182
#define B_mossy_stone_bricks 183
#define B_cracked_stone_bricks 184
#define B_chiseled_stone_bricks 185
#define B_packed_mud 186
#define B_mud_bricks 187
#define B_brown_mushroom_block 188
#define B_red_mushroom_block 189
#define B_mushroom_stem 190
#define B_iron_bars 191
#define B_copper_bars 192
#define B_exposed_copper_bars 193
#define B_weathered_copper_bars 194
#define B_oxidized_copper_bars 195
#define B_waxed_copper_bars 196
#define B_waxed_exposed_copper_bars 197
#define B_waxed_weathered_copper_bars 198
#define B_waxed_oxidized_copper_bars 199
#define B_iron_chain 200
#define B_copper_chain 201
#define B_exposed_copper_chain 202
#define B_weathered_copper_chain 203
#define B_oxidized_copper_chain 204
#define B_waxed_copper_chain 205
#define B_waxed_exposed_copper_chain 206
#define B_waxed_weathered_copper_chain 207
#define B_waxed_oxidized_copper_chain 208
#define B_glass_pane 209
#define B_pumpkin 210
#define B_melon 211
#define B_vine 212
#define B_glow_lichen 213
#define B_resin_clump 214
#define B_oak_fence_gate 215
#define B_brick_stairs 216
#define B_stone_brick_stairs 217
#define B_mud_brick_stairs 218
#define B_mycelium 219
#define B_resin_block 220
#define B_resin_bricks 221
#define B_resin_brick_stairs 222
#define B_resin_brick_slab 223
#define B_resin_brick_wall 224
#define B_chiseled_resin_bricks 225
#define B_nether_bricks 226
#define B_nether_brick_fence 227
#define B_nether_brick_stairs 228
#define B_nether_wart 229
#define B_enchanting_table 230
#define B_brewing_stand 231
#define B_cauldron 232
#define B_end_portal_frame 233
#define B_end_stone 234
#define B_dragon_egg 235
#define B_redstone_lamp 236
#define B_sandstone_stairs 237
#define B_emerald_ore 238
#define B_ender_chest 239
#define B_tripwire_hook 240
#define B_emerald_block 241
#define B_command_block 242
#define B_beacon 243
#define B_cobblestone_wall 244
#define B_mossy_cobblestone_wall 245
#define B_flower_pot 246
#define B_oak_button 247
#define B_skeleton_skull 248
#define B_wither_skeleton_skull 249
#define B_anvil 250
#define B_chipped_anvil 251
#define B_damaged_anvil 252
#define B_trapped_chest 253
#define B_light_weighted_pressure_plate 254
#define B_heavy_weighted_pressure_plate 255

