zkd27712306/ESP32-MC/ESP32-MC-main/src/registries.h
// 物品 ID
#define I_acacia_boat 872
#define I_acacia_button 756
#define I_acacia_chest_boat 873
#define I_acacia_door 785
#define I_acacia_fence 349
#define I_acacia_fence_gate 826
#define I_acacia_hanging_sign 1005
#define I_acacia_leaves 186
#define I_acacia_log 138
#define I_acacia_planks 40
#define I_acacia_pressure_plate 772
#define I_acacia_sapling 53
#define I_acacia_shelf 306
#define I_acacia_sign 993
#define I_acacia_slab 275
#define I_acacia_stairs 446
#define I_acacia_trapdoor 806
#define I_acacia_wood 175
#define I_activator_rail 837
#define I_air 0
#define I_allay_spawn_egg 1164
#define I_allium 235
#define I_amethyst_block 88
#define I_amethyst_cluster 1419
#define I_amethyst_shard 903
#define I_ancient_debris 82
#define I_andesite 6
#define I_andesite_slab 709
#define I_andesite_stairs 692
#define I_andesite_wall 467
#define I_angler_pottery_sherd 1446
#define I_anvil 479
#define I_apple 894
#define I_archer_pottery_sherd 1447
#define I_armadillo_scute 890
#define I_armadillo_spawn_egg 1142
#define I_armor_stand 1255
#define I_arms_up_pottery_sherd 1448
#define I_arrow 896
#define I_axolotl_bucket 1024
#define I_axolotl_spawn_egg 1152
#define I_azalea 205
#define I_azalea_leaves 191
#define I_azure_bluet 236
#define I_baked_potato 1230
#define I_bamboo 270
#define I_bamboo_block 147
#define I_bamboo_button 761
#define I_bamboo_chest_raft 883
#define I_bamboo_door 790
#define I_bamboo_fence 354
#define I_bamboo_fence_gate 831
#define I_bamboo_hanging_sign 1010
#define I_bamboo_mosaic 48
#define I_bamboo_mosaic_slab 281
#define I_bamboo_mosaic_stairs 452
#define I_bamboo_planks 45
#define I_bamboo_pressure_plate 777
#define I_bamboo_raft 882
#define I_bamboo_shelf 307
#define I_bamboo_sign 998
#define I_bamboo_slab 280
#define I_bamboo_stairs 451
#define I_bamboo_trapdoor 811
#define I_barrel 1355
#define I_barrier 503
#define I_basalt 363
#define I_bat_spawn_egg 1143
#define I_beacon 456
#define I_bedrock 58
#define I_bee_nest 1380
#define I_bee_spawn_egg 1144
#define I_beef 1111
#define I_beehive 1381
#define I_beetroot 1288
#define I_beetroot_seeds 1289
#define I_beetroot_soup 1290
#define I_bell 1363
#define I_big_dripleaf 268
#define I_birch_boat 868
#define I_birch_button 754
#define I_birch_chest_boat 869
#define I_birch_door 783
#define I_birch_fence 347
#define I_birch_fence_gate 824
#define I_birch_hanging_sign 1003
#define I_birch_leaves 184
#define I_birch_log 136
#define I_birch_planks 38
#define I_birch_pressure_plate 770
#define I_birch_sapling 51
#define I_birch_shelf 308
#define I_birch_sign 991
#define I_birch_slab 273
#define I_birch_stairs 444
#define I_birch_trapdoor 804
#define I_birch_wood 173
#define I_black_banner 1282
#define I_black_bed 1102
#define I_black_bundle 1053
#define I_black_candle 1415
#define I_black_carpet 521
#define I_black_concrete 630
#define I_black_concrete_powder 646
#define I_black_dye 1082
#define I_black_glazed_terracotta 614
#define I_black_harness 854
#define I_black_shulker_box 598
#define I_black_stained_glass 546
#define I_black_stained_glass_pane 562
#define I_black_terracotta 502
#define I_black_wool 228
#define I_blackstone 1386
#define I_blackstone_slab 1387
#define I_blackstone_stairs 1388
#define I_blackstone_wall 472
#define I_blade_pottery_sherd 1449
#define I_blast_furnace 1357
#define I_blaze_powder 1125
#define I_blaze_rod 1117
#define I_blaze_spawn_egg 1204
#define I_blue_banner 1278
#define I_blue_bed 1098
#define I_blue_bundle 1049
#define I_blue_candle 1411
#define I_blue_carpet 517
#define I_blue_concrete 626
#define I_blue_concrete_powder 642
#define I_blue_dye 1078
#define I_blue_egg 1033
#define I_blue_glazed_terracotta 610
#define I_blue_harness 850
#define I_blue_ice 680
#define I_blue_orchid 234
#define I_blue_shulker_box 594
#define I_blue_stained_glass 542
#define I_blue_stained_glass_pane 558
#define I_blue_terracotta 498
#define I_blue_wool 224
#define I_bogged_spawn_egg 1173
#define I_bolt_armor_trim_smithing_template 1445
#define I_bone 1084
#define I_bone_block 580
#define I_bone_meal 1083
#define I_book 1030
#define I_bookshelf 318
#define I_bordure_indented_banner_pattern 1352
#define I_bow 895
#define I_bowl 893
#define I_brain_coral 661
#define I_brain_coral_block 656
#define I_brain_coral_fan 671
#define I_bread 954
#define I_breeze_rod 1223
#define I_breeze_spawn_egg 1189
#define I_brewer_pottery_sherd 1450
#define I_brewing_stand 1127
#define I_brick 1026
#define I_brick_slab 290
#define I_brick_stairs 420
#define I_brick_wall 459
#define I_bricks 305
#define I_brown_banner 1279
#define I_brown_bed 1099
#define I_brown_bundle 1050
#define I_brown_candle 1412
#define I_brown_carpet 518
#define I_brown_concrete 627
#define I_brown_concrete_powder 643
#define I_brown_dye 1079
#define I_brown_egg 1034
#define I_brown_glazed_terracotta 611
#define I_brown_harness 851
#define I_brown_mushroom 248
#define I_brown_mushroom_block 388
#define I_brown_shulker_box 595
#define I_brown_stained_glass 543
#define I_brown_stained_glass_pane 559
#define I_brown_terracotta 499
#define I_brown_wool 225
#define I_brush 1426
#define I_bubble_coral 662
#define I_bubble_coral_block 657
#define I_bubble_coral_fan 672
#define I_bucket 1013
#define I_budding_amethyst 89
#define I_bundle 1037
#define I_burn_pottery_sherd 1451
#define I_bush 204
#define I_cactus 341
#define I_cactus_flower 342
#define I_cake 1086
#define I_calcite 11
#define I_calibrated_sculk_sensor 744
#define I_camel_husk_spawn_egg 1174
#define I_camel_spawn_egg 1135
#define I_campfire 1376
#define I_candle 1399
#define I_carrot 1228
#define I_carrot_on_a_stick 860
#define I_cartography_table 1358
#define I_carved_pumpkin 358
#define I_cat_spawn_egg 1139
#define I_cauldron 1128
#define I_cave_spider_spawn_egg 1187
#define I_chain_command_block 575
#define I_chainmail_boots 966
#define I_chainmail_chestplate 964
#define I_chainmail_helmet 963
#define I_chainmail_leggings 965
#define I_charcoal 898
#define I_cherry_boat 874
#define I_cherry_button 757
#define I_cherry_chest_boat 875
#define I_cherry_door 786
#define I_cherry_fence 350
#define I_cherry_fence_gate 827
#define I_cherry_hanging_sign 1006
#define I_cherry_leaves 187
#define I_cherry_log 139
#define I_cherry_planks 41
#define I_cherry_pressure_plate 773
#define I_cherry_sapling 54
#define I_cherry_shelf 309
#define I_cherry_sign 994
#define I_cherry_slab 276
#define I_cherry_stairs 447
#define I_cherry_trapdoor 807
#define I_cherry_wood 176
#define I_chest 332
#define I_chest_minecart 856
#define I_chicken 1113
#define I_chicken_spawn_egg 1131
#define I_chipped_anvil 480
#define I_chiseled_bookshelf 319
#define I_chiseled_copper 98
#define I_chiseled_deepslate 386
#define I_chiseled_nether_bricks 427
#define I_chiseled_polished_blackstone 1393
#define I_chiseled_quartz_block 482
#define I_chiseled_red_sandstone 571
#define I_chiseled_resin_bricks 419
#define I_chiseled_sandstone 199
#define I_chiseled_stone_bricks 379
#define I_chiseled_tuff 16
#define I_chiseled_tuff_bricks 25
#define I_chorus_flower 326
#define I_chorus_fruit 1284
#define I_chorus_plant 325
#define I_clay 343
#define I_clay_ball 1027
#define I_clock 1055
#define I_closed_eyeblossom 232
#define I_coal 897
#define I_coal_block 83
#define I_coal_ore 64
#define I_coarse_dirt 29
#define I_coast_armor_trim_smithing_template 1430
#define I_cobbled_deepslate 9
#define I_cobbled_deepslate_slab 713
#define I_cobbled_deepslate_stairs 696
#define I_cobbled_deepslate_wall 475
#define I_cobblestone 35
#define I_cobblestone_slab 289
#define I_cobblestone_stairs 337
#define I_cobblestone_wall 457
#define I_cobweb 201
#define I_cocoa_beans 1066
#define I_cod 1058
#define I_cod_bucket 1022
#define I_cod_spawn_egg 1153
#define I_command_block 455
#define I_command_block_minecart 1264
#define I_comparator 722
#define I_compass 1035
#define I_composter 1354
#define I_conduit 681
#define I_cooked_beef 1112
#define I_cooked_chicken 1114
#define I_cooked_cod 1062
#define I_cooked_mutton 1266
#define I_cooked_porkchop 985
#define I_cooked_rabbit 1251
#define I_cooked_salmon 1063
#define I_cookie 1103
#define I_copper_axe 920
#define I_copper_bars 392
#define I_copper_block 91
#define I_copper_boots 962
#define I_copper_bulb 1477
#define I_copper_chain 401
#define I_copper_chest 1485
#define I_copper_chestplate 960
#define I_copper_door 793
#define I_copper_golem_spawn_egg 1167
#define I_copper_golem_statue 1493
#define I_copper_grate 1469
#define I_copper_helmet 959
#define I_copper_hoe 921
#define I_copper_horse_armor 1256
#define I_copper_ingot 907
#define I_copper_lantern 1366
#define I_copper_leggings 961
#define I_copper_nautilus_armor 1338
#define I_copper_nugget 1307
#define I_copper_ore 68
#define I_copper_pickaxe 919
#define I_copper_shovel 918
#define I_copper_spear 1299
#define I_copper_sword 917
#define I_copper_torch 367
#define I_copper_trapdoor 814
#define I_cornflower 242
#define I_cow_spawn_egg 1132
#define I_cracked_deepslate_bricks 383
#define I_cracked_deepslate_tiles 385
#define I_cracked_nether_bricks 426
#define I_cracked_polished_blackstone_bricks 1397
#define I_cracked_stone_bricks 378
#define I_crafter 1104
#define I_crafting_table 333
#define I_creaking_heart 331
#define I_creaking_spawn_egg 1190
#define I_creeper_banner_pattern 1344
#define I_creeper_head 1238
#define I_creeper_spawn_egg 1191
#define I_crimson_button 762
#define I_crimson_door 791
#define I_crimson_fence 355
#define I_crimson_fence_gate 832
#define I_crimson_fungus 250
#define I_crimson_hanging_sign 1011
#define I_crimson_hyphae 180
#define I_crimson_nylium 33
#define I_crimson_planks 46
#define I_crimson_pressure_plate 778
#define I_crimson_roots 252
#define I_crimson_shelf 310
#define I_crimson_sign 999
#define I_crimson_slab 282
#define I_crimson_stairs 453
#define I_crimson_stem 145
#define I_crimson_trapdoor 812
#define I_crossbow 1340
#define I_crying_obsidian 1385
#define I_cut_copper 102
#define I_cut_copper_slab 110
#define I_cut_copper_stairs 106
#define I_cut_red_sandstone 572
#define I_cut_red_sandstone_slab 296
#define I_cut_sandstone 200
#define I_cut_sandstone_slab 287
#define I_cyan_banner 1276
#define I_cyan_bed 1096
#define I_cyan_bundle 1047
#define I_cyan_candle 1409
#define I_cyan_carpet 515
#define I_cyan_concrete 624
#define I_cyan_concrete_powder 640
#define I_cyan_dye 1076
#define I_cyan_glazed_terracotta 608
#define I_cyan_harness 848
#define I_cyan_shulker_box 592
#define I_cyan_stained_glass 540
#define I_cyan_stained_glass_pane 556
#define I_cyan_terracotta 496
#define I_cyan_wool 222
#define I_damaged_anvil 481
#define I_dandelion 229
#define I_danger_pottery_sherd 1452
#define I_dark_oak_boat 876
#define I_dark_oak_button 758
#define I_dark_oak_chest_boat 877
#define I_dark_oak_door 787
#define I_dark_oak_fence 351
#define I_dark_oak_fence_gate 828
#define I_dark_oak_hanging_sign 1007
#define I_dark_oak_leaves 188
#define I_dark_oak_log 141
#define I_dark_oak_planks 42
#define I_dark_oak_pressure_plate 774
#define I_dark_oak_sapling 55
#define I_dark_oak_shelf 311
#define I_dark_oak_sign 995
#define I_dark_oak_slab 277
#define I_dark_oak_stairs 448
#define I_dark_oak_trapdoor 808
#define I_dark_oak_wood 178
#define I_dark_prismarine 565
#define I_dark_prismarine_slab 300
#define I_dark_prismarine_stairs 568
#define I_daylight_detector 742
#define I_dead_brain_coral 665
#define I_dead_brain_coral_block 651
#define I_dead_brain_coral_fan 676
#define I_dead_bubble_coral 666
#define I_dead_bubble_coral_block 652
#define I_dead_bubble_coral_fan 677
#define I_dead_bush 207
#define I_dead_fire_coral 667
#define I_dead_fire_coral_block 653
#define I_dead_fire_coral_fan 678
#define I_dead_horn_coral 668
#define I_dead_horn_coral_block 654
#define I_dead_horn_coral_fan 679
#define I_dead_tube_coral 669
#define I_dead_tube_coral_block 650
#define I_dead_tube_coral_fan 675
#define I_debug_stick 1309
#define I_decorated_pot 320
#define I_deepslate 8
#define I_deepslate_brick_slab 715
#define I_deepslate_brick_stairs 698
#define I_deepslate_brick_wall 477
#define I_deepslate_bricks 382
#define I_deepslate_coal_ore 65
#define I_deepslate_copper_ore 69
#define I_deepslate_diamond_ore 79
#define I_deepslate_emerald_ore 75
#define I_deepslate_gold_ore 71
#define I_deepslate_iron_ore 67
#define I_deepslate_lapis_ore 77
#define I_deepslate_redstone_ore 73
#define I_deepslate_tile_slab 716
#define I_deepslate_tile_stairs 699
#define I_deepslate_tile_wall 478
#define I_deepslate_tiles 384
#define I_detector_rail 835
#define I_diamond 899
#define I_diamond_axe 940
#define I_diamond_block 93
#define I_diamond_boots 974
#define I_diamond_chestplate 972
#define I_diamond_helmet 971
#define I_diamond_hoe 941
#define I_diamond_horse_armor 1259
#define I_diamond_leggings 973
#define I_diamond_nautilus_armor 1336
#define I_diamond_ore 78
#define I_diamond_pickaxe 939
#define I_diamond_shovel 938
#define I_diamond_spear 1302
#define I_diamond_sword 937
#define I_diorite 4
#define I_diorite_slab 712
#define I_diorite_stairs 695
#define I_diorite_wall 471
#define I_dirt 28
#define I_dirt_path 524
#define I_disc_fragment_5 1331
#define I_dispenser 729
#define I_dolphin_spawn_egg 1154
#define I_donkey_spawn_egg 1136
#define I_dragon_breath 1291
#define I_dragon_egg 438
#define I_dragon_head 1239
#define I_dried_ghast 649
#define I_dried_kelp 1108
#define I_dried_kelp_block 1028
#define I_dripstone_block 26
#define I_dropper 730
#define I_drowned_spawn_egg 1175
#define I_dune_armor_trim_smithing_template 1429
#define I_echo_shard 1425
#define I_egg 1032
#define I_elder_guardian_spawn_egg 1192
#define I_elytra 863
#define I_emerald 900
#define I_emerald_block 441
#define I_emerald_ore 74
#define I_enchanted_book 1245
#define I_enchanted_golden_apple 988
#define I_enchanting_table 434
#define I_end_crystal 1283
#define I_end_portal_frame 435
#define I_end_rod 324
#define I_end_stone 436
#define I_end_stone_brick_slab 705
#define I_end_stone_brick_stairs 687
#define I_end_stone_brick_wall 470
#define I_end_stone_bricks 437
#define I_ender_chest 440
#define I_ender_dragon_spawn_egg 1214
#define I_ender_eye 1129
#define I_ender_pearl 1116
#define I_enderman_spawn_egg 1215
#define I_endermite_spawn_egg 1216
#define I_evoker_spawn_egg 1199
#define I_experience_bottle 1218
#define I_explorer_pottery_sherd 1453
#define I_exposed_chiseled_copper 99
#define I_exposed_copper 95
#define I_exposed_copper_bars 393
#define I_exposed_copper_bulb 1478
#define I_exposed_copper_chain 402
#define I_exposed_copper_chest 1486
#define I_exposed_copper_door 794
#define I_exposed_copper_golem_statue 1494
#define I_exposed_copper_grate 1470
#define I_exposed_copper_lantern 1367
#define I_exposed_copper_trapdoor 815
#define I_exposed_cut_copper 103
#define I_exposed_cut_copper_slab 111
#define I_exposed_cut_copper_stairs 107
#define I_exposed_lightning_rod 735
#define I_eye_armor_trim_smithing_template 1433
#define I_farmland 334
#define I_feather 950
#define I_fermented_spider_eye 1124
#define I_fern 203
#define I_field_masoned_banner_pattern 1351
#define I_filled_map 1105
#define I_fire_charge 1219
#define I_fire_coral 663
#define I_fire_coral_block 658
#define I_fire_coral_fan 673
#define I_firefly_bush 208
#define I_firework_rocket 1243
#define I_firework_star 1244
#define I_fishing_rod 1054
#define I_fletching_table 1359
#define I_flint 983
#define I_flint_and_steel 892
#define I_flow_armor_trim_smithing_template 1444
#define I_flow_banner_pattern 1349
#define I_flow_pottery_sherd 1454
#define I_flower_banner_pattern 1343
#define I_flower_pot 1227
#define I_flowering_azalea 206
#define I_flowering_azalea_leaves 192
#define I_fox_spawn_egg 1145
#define I_friend_pottery_sherd 1455
#define I_frog_spawn_egg 1155
#define I_frogspawn 1424
#define I_furnace 335
#define I_furnace_minecart 857
#define I_ghast_spawn_egg 1205
#define I_ghast_tear 1118
#define I_gilded_blackstone 1389
#define I_glass 195
#define I_glass_bottle 1121
#define I_glass_pane 409
#define I_glistering_melon_slice 1130
#define I_globe_banner_pattern 1347
#define I_glow_berries 1375
#define I_glow_ink_sac 1065
#define I_glow_item_frame 1226
#define I_glow_lichen 412
#define I_glow_squid_spawn_egg 1156
#define I_glowstone 368
#define I_glowstone_dust 1057
#define I_goat_horn 1353
#define I_goat_spawn_egg 1146
#define I_gold_block 92
#define I_gold_ingot 909
#define I_gold_nugget 1119
#define I_gold_ore 70
#define I_golden_apple 987
#define I_golden_axe 930
#define I_golden_boots 978
#define I_golden_carrot 1233
#define I_golden_chestplate 976
#define I_golden_dandelion 230
#define I_golden_helmet 975
#define I_golden_hoe 931
#define I_golden_horse_armor 1258
#define I_golden_leggings 977
#define I_golden_nautilus_armor 1335
#define I_golden_pickaxe 929
#define I_golden_shovel 928
#define I_golden_spear 1301
#define I_golden_sword 927
#define I_granite 2
#define I_granite_slab 708
#define I_granite_stairs 691
#define I_granite_wall 463
#define I_grass_block 27
#define I_gravel 63
#define I_gray_banner 1274
#define I_gray_bed 1094
#define I_gray_bundle 1045
#define I_gray_candle 1407
#define I_gray_carpet 513
#define I_gray_concrete 622
#define I_gray_concrete_powder 638
#define I_gray_dye 1074
#define I_gray_glazed_terracotta 606
#define I_gray_harness 846
#define I_gray_shulker_box 590
#define I_gray_stained_glass 538
#define I_gray_stained_glass_pane 554
#define I_gray_terracotta 494
#define I_gray_wool 220
#define I_green_banner 1280
#define I_green_bed 1100
#define I_green_bundle 1051
#define I_green_candle 1413
#define I_green_carpet 519
#define I_green_concrete 628
#define I_green_concrete_powder 644
#define I_green_dye 1080
#define I_green_glazed_terracotta 612
#define I_green_harness 852
#define I_green_shulker_box 596
#define I_green_stained_glass 544
#define I_green_stained_glass_pane 560
#define I_green_terracotta 500
#define I_green_wool 226
#define I_grindstone 1360
#define I_guardian_spawn_egg 1193
#define I_gunpowder 951
#define I_guster_banner_pattern 1350
#define I_guster_pottery_sherd 1456
#define I_hanging_roots 267
#define I_happy_ghast_spawn_egg 1206
#define I_hay_block 505
#define I_heart_of_the_sea 1339
#define I_heart_pottery_sherd 1457
#define I_heartbreak_pottery_sherd 1458
#define I_heavy_core 87
#define I_heavy_weighted_pressure_plate 767
#define I_hoglin_spawn_egg 1207
#define I_honey_block 726
#define I_honey_bottle 1382
#define I_honeycomb 1379
#define I_honeycomb_block 1383
#define I_hopper 728
#define I_hopper_minecart 859
#define I_horn_coral 664
#define I_horn_coral_block 659
#define I_horn_coral_fan 674
#define I_horse_spawn_egg 1137
#define I_host_armor_trim_smithing_template 1443
#define I_howl_pottery_sherd 1459
#define I_husk_spawn_egg 1176
#define I_ice 339
#define I_infested_chiseled_stone_bricks 374
#define I_infested_cobblestone 370
#define I_infested_cracked_stone_bricks 373
#define I_infested_deepslate 375
#define I_infested_mossy_stone_bricks 372
#define I_infested_stone 369
#define I_infested_stone_bricks 371
#define I_ink_sac 1064
#define I_iron_axe 935
#define I_iron_bars 391
#define I_iron_block 90
#define I_iron_boots 970
#define I_iron_chain 400
#define I_iron_chestplate 968
#define I_iron_door 780
#define I_iron_golem_spawn_egg 1168
#define I_iron_helmet 967
#define I_iron_hoe 936
#define I_iron_horse_armor 1257
#define I_iron_ingot 905
#define I_iron_leggings 969
#define I_iron_nautilus_armor 1334
#define I_iron_nugget 1306
#define I_iron_ore 66
#define I_iron_pickaxe 934
#define I_iron_shovel 933
#define I_iron_spear 1300
#define I_iron_sword 932
#define I_iron_trapdoor 801
#define I_item_frame 1225
#define I_jack_o_lantern 359
#define I_jigsaw 885
#define I_jukebox 344
#define I_jungle_boat 870
#define I_jungle_button 755
#define I_jungle_chest_boat 871
#define I_jungle_door 784
#define I_jungle_fence 348
#define I_jungle_fence_gate 825
#define I_jungle_hanging_sign 1004
#define I_jungle_leaves 185
#define I_jungle_log 137
#define I_jungle_planks 39
#define I_jungle_pressure_plate 771
#define I_jungle_sapling 52
#define I_jungle_shelf 312
#define I_jungle_sign 992
#define I_jungle_slab 274
#define I_jungle_stairs 445
#define I_jungle_trapdoor 805
#define I_jungle_wood 174
#define I_kelp 258
#define I_knowledge_book 1308
#define I_ladder 336
#define I_lantern 1364
#define I_lapis_block 197
#define I_lapis_lazuli 901
#define I_lapis_ore 76
#define I_large_amethyst_bud 1418
#define I_large_fern 530
#define I_lava_bucket 1015
#define I_lead 1262
#define I_leaf_litter 261
#define I_leather 1018
#define I_leather_boots 958
#define I_leather_chestplate 956
#define I_leather_helmet 955
#define I_leather_horse_armor 1261
#define I_leather_leggings 957
#define I_lectern 731
#define I_lever 733
#define I_light 504
#define I_light_blue_banner 1270
#define I_light_blue_bed 1090
#define I_light_blue_bundle 1041
#define I_light_blue_candle 1403
#define I_light_blue_carpet 509
#define I_light_blue_concrete 618
#define I_light_blue_concrete_powder 634
#define I_light_blue_dye 1070
#define I_light_blue_glazed_terracotta 602
#define I_light_blue_harness 842
#define I_light_blue_shulker_box 586
#define I_light_blue_stained_glass 534
#define I_light_blue_stained_glass_pane 550
#define I_light_blue_terracotta 490
#define I_light_blue_wool 216
#define I_light_gray_banner 1275
#define I_light_gray_bed 1095
#define I_light_gray_bundle 1046
#define I_light_gray_candle 1408
#define I_light_gray_carpet 514
#define I_light_gray_concrete 623
#define I_light_gray_concrete_powder 639
#define I_light_gray_dye 1075
#define I_light_gray_glazed_terracotta 607
#define I_light_gray_harness 847
#define I_light_gray_shulker_box 591
#define I_light_gray_stained_glass 539
#define I_light_gray_stained_glass_pane 555
#define I_light_gray_terracotta 495
#define I_light_gray_wool 221
#define I_light_weighted_pressure_plate 766
#define I_lightning_rod 734
#define I_lilac 526
#define I_lily_of_the_valley 243
#define I_lily_pad 424
#define I_lime_banner 1272
#define I_lime_bed 1092
#define I_lime_bundle 1043
#define I_lime_candle 1405
#define I_lime_carpet 511
#define I_lime_concrete 620
#define I_lime_concrete_powder 636
#define I_lime_dye 1072
#define I_lime_glazed_terracotta 604
#define I_lime_harness 844
#define I_lime_shulker_box 588
#define I_lime_stained_glass 536
#define I_lime_stained_glass_pane 552
#define I_lime_terracotta 492
#define I_lime_wool 218
#define I_lingering_potion 1295
#define I_llama_spawn_egg 1147
#define I_lodestone 1384
#define I_loom 1342
#define I_mace 1224
#define I_magenta_banner 1269
#define I_magenta_bed 1089
#define I_magenta_bundle 1040
#define I_magenta_candle 1402
#define I_magenta_carpet 508
#define I_magenta_concrete 617
#define I_magenta_concrete_powder 633
#define I_magenta_dye 1069
#define I_magenta_glazed_terracotta 601
#define I_magenta_harness 841
#define I_magenta_shulker_box 585
#define I_magenta_stained_glass 533
#define I_magenta_stained_glass_pane 549
#define I_magenta_terracotta 489
#define I_magenta_wool 215
#define I_magma_block 576
#define I_magma_cream 1126
#define I_magma_cube_spawn_egg 1208
#define I_mangrove_boat 880
#define I_mangrove_button 760
#define I_mangrove_chest_boat 881
#define I_mangrove_door 789
#define I_mangrove_fence 353
#define I_mangrove_fence_gate 830
#define I_mangrove_hanging_sign 1009
#define I_mangrove_leaves 190
#define I_mangrove_log 142
#define I_mangrove_planks 44
#define I_mangrove_pressure_plate 776
#define I_mangrove_propagule 57
#define I_mangrove_roots 143
#define I_mangrove_shelf 313
#define I_mangrove_sign 997
#define I_mangrove_slab 279
#define I_mangrove_stairs 450
#define I_mangrove_trapdoor 810
#define I_mangrove_wood 179
#define I_map 1232
#define I_medium_amethyst_bud 1417
#define I_melon 410
#define I_melon_seeds 1110
#define I_melon_slice 1107
#define I_milk_bucket 1019
#define I_minecart 855
#define I_miner_pottery_sherd 1460
#define I_mojang_banner_pattern 1346
#define I_mooshroom_spawn_egg 1165
#define I_moss_block 263
#define I_moss_carpet 262
