zkd27712306/ESP32-MC/ESP32-MC-main/src/registries.h
#define I_mossy_cobblestone 321
#define I_mossy_cobblestone_slab 704
#define I_mossy_cobblestone_stairs 686
#define I_mossy_cobblestone_wall 458
#define I_mossy_stone_brick_slab 702
#define I_mossy_stone_brick_stairs 684
#define I_mossy_stone_brick_wall 462
#define I_mossy_stone_bricks 377
#define I_mourner_pottery_sherd 1461
#define I_mud 32
#define I_mud_brick_slab 292
#define I_mud_brick_stairs 422
#define I_mud_brick_wall 465
#define I_mud_bricks 381
#define I_muddy_mangrove_roots 144
#define I_mule_spawn_egg 1138
#define I_mushroom_stem 390
#define I_mushroom_stew 948
#define I_music_disc_11 1323
#define I_music_disc_13 1310
#define I_music_disc_5 1327
#define I_music_disc_blocks 1312
#define I_music_disc_cat 1311
#define I_music_disc_chirp 1313
#define I_music_disc_creator 1314
#define I_music_disc_creator_music_box 1315
#define I_music_disc_far 1316
#define I_music_disc_lava_chicken 1317
#define I_music_disc_mall 1318
#define I_music_disc_mellohi 1319
#define I_music_disc_otherside 1325
#define I_music_disc_pigstep 1328
#define I_music_disc_precipice 1329
#define I_music_disc_relic 1326
#define I_music_disc_stal 1320
#define I_music_disc_strad 1321
#define I_music_disc_tears 1330
#define I_music_disc_wait 1324
#define I_music_disc_ward 1322
#define I_mutton 1265
#define I_mycelium 423
#define I_name_tag 1263
#define I_nautilus_shell 1333
#define I_nautilus_spawn_egg 1157
#define I_nether_brick 1246
#define I_nether_brick_fence 428
#define I_nether_brick_slab 293
#define I_nether_brick_stairs 429
#define I_nether_brick_wall 466
#define I_nether_bricks 425
#define I_nether_gold_ore 80
#define I_nether_quartz_ore 81
#define I_nether_sprouts 254
#define I_nether_star 1241
#define I_nether_wart 1120
#define I_nether_wart_block 577
#define I_netherite_axe 945
#define I_netherite_block 94
#define I_netherite_boots 982
#define I_netherite_chestplate 980
#define I_netherite_helmet 979
#define I_netherite_hoe 946
#define I_netherite_horse_armor 1260
#define I_netherite_ingot 910
#define I_netherite_leggings 981
#define I_netherite_nautilus_armor 1337
#define I_netherite_pickaxe 944
#define I_netherite_scrap 911
#define I_netherite_shovel 943
#define I_netherite_spear 1303
#define I_netherite_sword 942
#define I_netherite_upgrade_smithing_template 1427
#define I_netherrack 360
#define I_note_block 749
#define I_oak_boat 864
#define I_oak_button 752
#define I_oak_chest_boat 865
#define I_oak_door 781
#define I_oak_fence 345
#define I_oak_fence_gate 822
#define I_oak_hanging_sign 1001
#define I_oak_leaves 182
#define I_oak_log 134
#define I_oak_planks 36
#define I_oak_pressure_plate 768
#define I_oak_sapling 49
#define I_oak_shelf 314
#define I_oak_sign 989
#define I_oak_slab 271
#define I_oak_stairs 442
#define I_oak_trapdoor 802
#define I_oak_wood 171
#define I_observer 727
#define I_obsidian 322
#define I_ocelot_spawn_egg 1148
#define I_ochre_froglight 1421
#define I_ominous_bottle 1505
#define I_ominous_trial_key 1503
#define I_open_eyeblossom 231
#define I_orange_banner 1268
#define I_orange_bed 1088
#define I_orange_bundle 1039
#define I_orange_candle 1401
#define I_orange_carpet 507
#define I_orange_concrete 616
#define I_orange_concrete_powder 632
#define I_orange_dye 1068
#define I_orange_glazed_terracotta 600
#define I_orange_harness 840
#define I_orange_shulker_box 584
#define I_orange_stained_glass 532
#define I_orange_stained_glass_pane 548
#define I_orange_terracotta 488
#define I_orange_tulip 238
#define I_orange_wool 214
#define I_oxeye_daisy 241
#define I_oxidized_chiseled_copper 101
#define I_oxidized_copper 97
#define I_oxidized_copper_bars 395
#define I_oxidized_copper_bulb 1480
#define I_oxidized_copper_chain 404
#define I_oxidized_copper_chest 1488
#define I_oxidized_copper_door 796
#define I_oxidized_copper_golem_statue 1496
#define I_oxidized_copper_grate 1472
#define I_oxidized_copper_lantern 1369
#define I_oxidized_copper_trapdoor 817
#define I_oxidized_cut_copper 105
#define I_oxidized_cut_copper_slab 113
#define I_oxidized_cut_copper_stairs 109
#define I_oxidized_lightning_rod 737
#define I_packed_ice 523
#define I_packed_mud 380
#define I_painting 986
#define I_pale_hanging_moss 265
#define I_pale_moss_block 266
#define I_pale_moss_carpet 264
#define I_pale_oak_boat 878
#define I_pale_oak_button 759
#define I_pale_oak_chest_boat 879
#define I_pale_oak_door 788
#define I_pale_oak_fence 352
#define I_pale_oak_fence_gate 829
#define I_pale_oak_hanging_sign 1008
#define I_pale_oak_leaves 189
#define I_pale_oak_log 140
#define I_pale_oak_planks 43
#define I_pale_oak_pressure_plate 775
#define I_pale_oak_sapling 56
#define I_pale_oak_shelf 315
#define I_pale_oak_sign 996
#define I_pale_oak_slab 278
#define I_pale_oak_stairs 449
#define I_pale_oak_trapdoor 809
#define I_pale_oak_wood 177
#define I_panda_spawn_egg 1149
#define I_paper 1029
#define I_parched_spawn_egg 1177
#define I_parrot_spawn_egg 1140
#define I_pearlescent_froglight 1423
#define I_peony 528
#define I_petrified_oak_slab 288
#define I_phantom_membrane 862
#define I_phantom_spawn_egg 1194
#define I_pig_spawn_egg 1133
#define I_piglin_banner_pattern 1348
#define I_piglin_brute_spawn_egg 1210
#define I_piglin_head 1240
#define I_piglin_spawn_egg 1209
#define I_pillager_spawn_egg 1200
#define I_pink_banner 1273
#define I_pink_bed 1093
#define I_pink_bundle 1044
#define I_pink_candle 1406
#define I_pink_carpet 512
#define I_pink_concrete 621
#define I_pink_concrete_powder 637
#define I_pink_dye 1073
#define I_pink_glazed_terracotta 605
#define I_pink_harness 845
#define I_pink_petals 259
#define I_pink_shulker_box 589
#define I_pink_stained_glass 537
#define I_pink_stained_glass_pane 553
#define I_pink_terracotta 493
#define I_pink_tulip 240
#define I_pink_wool 219
#define I_piston 723
#define I_pitcher_plant 246
#define I_pitcher_pod 1287
#define I_player_head 1236
#define I_plenty_pottery_sherd 1462
#define I_podzol 30
#define I_pointed_dripstone 1420
#define I_poisonous_potato 1231
#define I_polar_bear_spawn_egg 1150
#define I_polished_andesite 7
#define I_polished_andesite_slab 711
#define I_polished_andesite_stairs 694
#define I_polished_basalt 364
#define I_polished_blackstone 1390
#define I_polished_blackstone_brick_slab 1395
#define I_polished_blackstone_brick_stairs 1396
#define I_polished_blackstone_brick_wall 474
#define I_polished_blackstone_bricks 1394
#define I_polished_blackstone_button 751
#define I_polished_blackstone_pressure_plate 765
#define I_polished_blackstone_slab 1391
#define I_polished_blackstone_stairs 1392
#define I_polished_blackstone_wall 473
#define I_polished_deepslate 10
#define I_polished_deepslate_slab 714
#define I_polished_deepslate_stairs 697
#define I_polished_deepslate_wall 476
#define I_polished_diorite 5
#define I_polished_diorite_slab 703
#define I_polished_diorite_stairs 685
#define I_polished_granite 3
#define I_polished_granite_slab 700
#define I_polished_granite_stairs 682
#define I_polished_tuff 17
#define I_polished_tuff_slab 18
#define I_polished_tuff_stairs 19
#define I_polished_tuff_wall 20
#define I_popped_chorus_fruit 1285
#define I_poppy 233
#define I_porkchop 984
#define I_potato 1229
#define I_potion 1122
#define I_powder_snow_bucket 1016
#define I_powered_rail 834
#define I_prismarine 563
#define I_prismarine_brick_slab 299
#define I_prismarine_brick_stairs 567
#define I_prismarine_bricks 564
#define I_prismarine_crystals 1249
#define I_prismarine_shard 1248
#define I_prismarine_slab 298
#define I_prismarine_stairs 566
#define I_prismarine_wall 460
#define I_prize_pottery_sherd 1463
#define I_pufferfish 1061
#define I_pufferfish_bucket 1020
#define I_pufferfish_spawn_egg 1158
#define I_pumpkin 357
#define I_pumpkin_pie 1242
#define I_pumpkin_seeds 1109
#define I_purple_banner 1277
#define I_purple_bed 1097
#define I_purple_bundle 1048
#define I_purple_candle 1410
#define I_purple_carpet 516
#define I_purple_concrete 625
#define I_purple_concrete_powder 641
#define I_purple_dye 1077
#define I_purple_glazed_terracotta 609
#define I_purple_harness 849
#define I_purple_shulker_box 593
#define I_purple_stained_glass 541
#define I_purple_stained_glass_pane 557
#define I_purple_terracotta 497
#define I_purple_wool 223
#define I_purpur_block 327
#define I_purpur_pillar 328
#define I_purpur_slab 297
#define I_purpur_stairs 329
#define I_quartz 902
#define I_quartz_block 483
#define I_quartz_bricks 484
#define I_quartz_pillar 485
#define I_quartz_slab 294
#define I_quartz_stairs 486
#define I_rabbit 1250
#define I_rabbit_foot 1253
#define I_rabbit_hide 1254
#define I_rabbit_spawn_egg 1151
#define I_rabbit_stew 1252
#define I_rail 836
#define I_raiser_armor_trim_smithing_template 1442
#define I_ravager_spawn_egg 1201
#define I_raw_copper 906
#define I_raw_copper_block 85
#define I_raw_gold 908
#define I_raw_gold_block 86
#define I_raw_iron 904
#define I_raw_iron_block 84
#define I_recovery_compass 1036
#define I_red_banner 1281
#define I_red_bed 1101
#define I_red_bundle 1052
#define I_red_candle 1414
#define I_red_carpet 520
#define I_red_concrete 629
#define I_red_concrete_powder 645
#define I_red_dye 1081
#define I_red_glazed_terracotta 613
#define I_red_harness 853
#define I_red_mushroom 249
#define I_red_mushroom_block 389
#define I_red_nether_brick_slab 710
#define I_red_nether_brick_stairs 693
#define I_red_nether_brick_wall 468
#define I_red_nether_bricks 579
#define I_red_sand 62
#define I_red_sandstone 570
#define I_red_sandstone_slab 295
#define I_red_sandstone_stairs 573
#define I_red_sandstone_wall 461
#define I_red_shulker_box 597
#define I_red_stained_glass 545
#define I_red_stained_glass_pane 561
#define I_red_terracotta 501
#define I_red_tulip 237
#define I_red_wool 227
#define I_redstone 718
#define I_redstone_block 720
#define I_redstone_lamp 748
#define I_redstone_ore 72
#define I_redstone_torch 719
#define I_reinforced_deepslate 387
#define I_repeater 721
#define I_repeating_command_block 574
#define I_resin_block 414
#define I_resin_brick 1247
#define I_resin_brick_slab 417
#define I_resin_brick_stairs 416
#define I_resin_brick_wall 418
#define I_resin_bricks 415
#define I_resin_clump 413
#define I_respawn_anchor 1398
#define I_rib_armor_trim_smithing_template 1437
#define I_rooted_dirt 31
#define I_rose_bush 527
#define I_rotten_flesh 1115
#define I_saddle 838
#define I_salmon 1059
#define I_salmon_bucket 1021
#define I_salmon_spawn_egg 1159
#define I_sand 59
#define I_sandstone 198
#define I_sandstone_slab 286
#define I_sandstone_stairs 439
#define I_sandstone_wall 469
#define I_scaffolding 717
#define I_scrape_pottery_sherd 1464
#define I_sculk 430
#define I_sculk_catalyst 432
#define I_sculk_sensor 743
#define I_sculk_shrieker 433
#define I_sculk_vein 431
#define I_sea_lantern 569
#define I_sea_pickle 212
#define I_seagrass 211
#define I_sentry_armor_trim_smithing_template 1428
#define I_shaper_armor_trim_smithing_template 1440
#define I_sheaf_pottery_sherd 1465
#define I_shears 1106
#define I_sheep_spawn_egg 1134
#define I_shelter_pottery_sherd 1466
#define I_shield 1296
#define I_short_dry_grass 209
#define I_short_grass 202
#define I_shroomlight 1378
#define I_shulker_box 582
#define I_shulker_shell 1305
#define I_shulker_spawn_egg 1217
#define I_silence_armor_trim_smithing_template 1441
#define I_silverfish_spawn_egg 1195
#define I_skeleton_horse_spawn_egg 1179
#define I_skeleton_skull 1234
#define I_skeleton_spawn_egg 1178
#define I_skull_banner_pattern 1345
#define I_skull_pottery_sherd 1467
#define I_slime_ball 1031
#define I_slime_block 725
#define I_slime_spawn_egg 1196
#define I_small_amethyst_bud 1416
#define I_small_dripleaf 269
#define I_smithing_table 1361
#define I_smoker 1356
#define I_smooth_basalt 365
#define I_smooth_quartz 301
#define I_smooth_quartz_slab 707
#define I_smooth_quartz_stairs 690
#define I_smooth_red_sandstone 302
#define I_smooth_red_sandstone_slab 701
#define I_smooth_red_sandstone_stairs 683
#define I_smooth_sandstone 303
#define I_smooth_sandstone_slab 706
#define I_smooth_sandstone_stairs 689
#define I_smooth_stone 304
#define I_smooth_stone_slab 285
#define I_sniffer_egg 648
#define I_sniffer_spawn_egg 1166
#define I_snort_pottery_sherd 1468
#define I_snout_armor_trim_smithing_template 1436
#define I_snow 338
#define I_snow_block 340
#define I_snow_golem_spawn_egg 1169
#define I_snowball 1017
#define I_soul_campfire 1377
#define I_soul_lantern 1365
#define I_soul_sand 361
#define I_soul_soil 362
#define I_soul_torch 366
#define I_spawner 330
#define I_spectral_arrow 1293
#define I_spider_eye 1123
#define I_spider_spawn_egg 1188
#define I_spire_armor_trim_smithing_template 1438
#define I_splash_potion 1292
#define I_sponge 193
#define I_spore_blossom 247
#define I_spruce_boat 866
#define I_spruce_button 753
#define I_spruce_chest_boat 867
#define I_spruce_door 782
#define I_spruce_fence 346
#define I_spruce_fence_gate 823
#define I_spruce_hanging_sign 1002
#define I_spruce_leaves 183
#define I_spruce_log 135
#define I_spruce_planks 37
#define I_spruce_pressure_plate 769
#define I_spruce_sapling 50
#define I_spruce_shelf 316
#define I_spruce_sign 990
#define I_spruce_slab 272
#define I_spruce_stairs 443
#define I_spruce_trapdoor 803
#define I_spruce_wood 172
#define I_spyglass 1056
#define I_squid_spawn_egg 1160
#define I_stick 947
#define I_sticky_piston 724
#define I_stone 1
#define I_stone_axe 925
#define I_stone_brick_slab 291
#define I_stone_brick_stairs 421
#define I_stone_brick_wall 464
#define I_stone_bricks 376
#define I_stone_button 750
#define I_stone_hoe 926
#define I_stone_pickaxe 924
#define I_stone_pressure_plate 764
#define I_stone_shovel 923
#define I_stone_slab 284
#define I_stone_spear 1298
#define I_stone_stairs 688
#define I_stone_sword 922
#define I_stonecutter 1362
#define I_stray_spawn_egg 1180
#define I_strider_spawn_egg 1211
#define I_string 949
#define I_stripped_acacia_log 152
#define I_stripped_acacia_wood 163
#define I_stripped_bamboo_block 170
#define I_stripped_birch_log 150
#define I_stripped_birch_wood 161
#define I_stripped_cherry_log 153
#define I_stripped_cherry_wood 164
#define I_stripped_crimson_hyphae 168
#define I_stripped_crimson_stem 157
#define I_stripped_dark_oak_log 154
#define I_stripped_dark_oak_wood 165
#define I_stripped_jungle_log 151
#define I_stripped_jungle_wood 162
#define I_stripped_mangrove_log 156
#define I_stripped_mangrove_wood 167
#define I_stripped_oak_log 148
#define I_stripped_oak_wood 159
#define I_stripped_pale_oak_log 155
#define I_stripped_pale_oak_wood 166
#define I_stripped_spruce_log 149
#define I_stripped_spruce_wood 160
#define I_stripped_warped_hyphae 169
#define I_stripped_warped_stem 158
#define I_structure_block 884
#define I_structure_void 581
#define I_sugar 1085
#define I_sugar_cane 257
#define I_sunflower 525
#define I_suspicious_gravel 61
#define I_suspicious_sand 60
#define I_suspicious_stew 1341
#define I_sweet_berries 1374
#define I_tadpole_bucket 1025
#define I_tadpole_spawn_egg 1161
#define I_tall_dry_grass 210
#define I_tall_grass 529
#define I_target 732
#define I_terracotta 522
#define I_test_block 886
#define I_test_instance_block 887
#define I_tide_armor_trim_smithing_template 1435
#define I_tinted_glass 196
#define I_tipped_arrow 1294
#define I_tnt 747
#define I_tnt_minecart 858
#define I_torch 323
#define I_torchflower 245
#define I_torchflower_seeds 1286
#define I_totem_of_undying 1304
#define I_trader_llama_spawn_egg 1170
#define I_trapped_chest 746
#define I_trial_key 1502
#define I_trial_spawner 1501
#define I_trident 1332
#define I_tripwire_hook 745
#define I_tropical_fish 1060
#define I_tropical_fish_bucket 1023
#define I_tropical_fish_spawn_egg 1162
#define I_tube_coral 660
#define I_tube_coral_block 655
#define I_tube_coral_fan 670
#define I_tuff 12
#define I_tuff_brick_slab 22
#define I_tuff_brick_stairs 23
#define I_tuff_brick_wall 24
#define I_tuff_bricks 21
#define I_tuff_slab 13
#define I_tuff_stairs 14
#define I_tuff_wall 15
#define I_turtle_egg 647
#define I_turtle_helmet 888
#define I_turtle_scute 889
#define I_turtle_spawn_egg 1163
#define I_twisting_vines 256
#define I_vault 1504
#define I_verdant_froglight 1422
#define I_vex_armor_trim_smithing_template 1434
#define I_vex_spawn_egg 1203
#define I_villager_spawn_egg 1171
#define I_vindicator_spawn_egg 1202
#define I_vine 411
#define I_wandering_trader_spawn_egg 1172
#define I_ward_armor_trim_smithing_template 1432
#define I_warden_spawn_egg 1197
#define I_warped_button 763
#define I_warped_door 792
#define I_warped_fence 356
#define I_warped_fence_gate 833
#define I_warped_fungus 251
#define I_warped_fungus_on_a_stick 861
#define I_warped_hanging_sign 1012
#define I_warped_hyphae 181
#define I_warped_nylium 34
#define I_warped_planks 47
#define I_warped_pressure_plate 779
#define I_warped_roots 253
#define I_warped_shelf 317
#define I_warped_sign 1000
#define I_warped_slab 283
#define I_warped_stairs 454
#define I_warped_stem 146
#define I_warped_trapdoor 813
#define I_warped_wart_block 578
#define I_water_bucket 1014
#define I_waxed_chiseled_copper 118
#define I_waxed_copper_bars 396
#define I_waxed_copper_block 114
#define I_waxed_copper_bulb 1481
#define I_waxed_copper_chain 405
#define I_waxed_copper_chest 1489
#define I_waxed_copper_door 797
#define I_waxed_copper_golem_statue 1497
#define I_waxed_copper_grate 1473
#define I_waxed_copper_lantern 1370
#define I_waxed_copper_trapdoor 818
#define I_waxed_cut_copper 122
#define I_waxed_cut_copper_slab 130
#define I_waxed_cut_copper_stairs 126
#define I_waxed_exposed_chiseled_copper 119
#define I_waxed_exposed_copper 115
#define I_waxed_exposed_copper_bars 397
#define I_waxed_exposed_copper_bulb 1482
#define I_waxed_exposed_copper_chain 406
#define I_waxed_exposed_copper_chest 1490
#define I_waxed_exposed_copper_door 798
#define I_waxed_exposed_copper_golem_statue 1498
#define I_waxed_exposed_copper_grate 1474
#define I_waxed_exposed_copper_lantern 1371
#define I_waxed_exposed_copper_trapdoor 819
#define I_waxed_exposed_cut_copper 123
#define I_waxed_exposed_cut_copper_slab 131
#define I_waxed_exposed_cut_copper_stairs 127
#define I_waxed_exposed_lightning_rod 739
#define I_waxed_lightning_rod 738
#define I_waxed_oxidized_chiseled_copper 121
#define I_waxed_oxidized_copper 117
#define I_waxed_oxidized_copper_bars 399
#define I_waxed_oxidized_copper_bulb 1484
#define I_waxed_oxidized_copper_chain 408
#define I_waxed_oxidized_copper_chest 1492
#define I_waxed_oxidized_copper_door 800
#define I_waxed_oxidized_copper_golem_statue 1500
#define I_waxed_oxidized_copper_grate 1476
#define I_waxed_oxidized_copper_lantern 1373
#define I_waxed_oxidized_copper_trapdoor 821
#define I_waxed_oxidized_cut_copper 125
#define I_waxed_oxidized_cut_copper_slab 133
#define I_waxed_oxidized_cut_copper_stairs 129
#define I_waxed_oxidized_lightning_rod 741
#define I_waxed_weathered_chiseled_copper 120
#define I_waxed_weathered_copper 116
#define I_waxed_weathered_copper_bars 398
#define I_waxed_weathered_copper_bulb 1483
#define I_waxed_weathered_copper_chain 407
#define I_waxed_weathered_copper_chest 1491
#define I_waxed_weathered_copper_door 799
#define I_waxed_weathered_copper_golem_statue 1499
#define I_waxed_weathered_copper_grate 1475
#define I_waxed_weathered_copper_lantern 1372
#define I_waxed_weathered_copper_trapdoor 820
#define I_waxed_weathered_cut_copper 124
#define I_waxed_weathered_cut_copper_slab 132
#define I_waxed_weathered_cut_copper_stairs 128
#define I_waxed_weathered_lightning_rod 740
#define I_wayfinder_armor_trim_smithing_template 1439
#define I_weathered_chiseled_copper 100
#define I_weathered_copper 96
#define I_weathered_copper_bars 394
#define I_weathered_copper_bulb 1479
#define I_weathered_copper_chain 403
#define I_weathered_copper_chest 1487
#define I_weathered_copper_door 795
#define I_weathered_copper_golem_statue 1495
#define I_weathered_copper_grate 1471
#define I_weathered_copper_lantern 1368
#define I_weathered_copper_trapdoor 816
#define I_weathered_cut_copper 104
#define I_weathered_cut_copper_slab 112
#define I_weathered_cut_copper_stairs 108
#define I_weathered_lightning_rod 736
#define I_weeping_vines 255
#define I_wet_sponge 194
#define I_wheat 953
#define I_wheat_seeds 952
#define I_white_banner 1267
#define I_white_bed 1087
#define I_white_bundle 1038
#define I_white_candle 1400
#define I_white_carpet 506
#define I_white_concrete 615
#define I_white_concrete_powder 631
#define I_white_dye 1067
#define I_white_glazed_terracotta 599
#define I_white_harness 839
#define I_white_shulker_box 583
#define I_white_stained_glass 531
#define I_white_stained_glass_pane 547
#define I_white_terracotta 487
#define I_white_tulip 239
#define I_white_wool 213
#define I_wild_armor_trim_smithing_template 1431
#define I_wildflowers 260
#define I_wind_charge 1220
#define I_witch_spawn_egg 1198
#define I_wither_rose 244
#define I_wither_skeleton_skull 1235
#define I_wither_skeleton_spawn_egg 1182
#define I_wither_spawn_egg 1181
#define I_wolf_armor 891
#define I_wolf_spawn_egg 1141
#define I_wooden_axe 915
#define I_wooden_hoe 916
#define I_wooden_pickaxe 914
#define I_wooden_shovel 913
#define I_wooden_spear 1297
#define I_wooden_sword 912
#define I_writable_book 1221
#define I_written_book 1222
#define I_yellow_banner 1271
#define I_yellow_bed 1091
#define I_yellow_bundle 1042
#define I_yellow_candle 1404
#define I_yellow_carpet 510
#define I_yellow_concrete 619
#define I_yellow_concrete_powder 635
#define I_yellow_dye 1071
#define I_yellow_glazed_terracotta 603
#define I_yellow_harness 843
#define I_yellow_shulker_box 587
#define I_yellow_stained_glass 535
#define I_yellow_stained_glass_pane 551
#define I_yellow_terracotta 491
#define I_yellow_wool 217
#define I_zoglin_spawn_egg 1212
#define I_zombie_head 1237
#define I_zombie_horse_spawn_egg 1184
#define I_zombie_nautilus_spawn_egg 1185
#define I_zombie_spawn_egg 1183
#define I_zombie_villager_spawn_egg 1186
#define I_zombified_piglin_spawn_egg 1213

// biome ID
#define W_plains 40
#define W_mangrove_swamp 31
#define W_desert 14
#define W_snowy_plains 46
#define W_beach 3

// 伤害类型 ID
#define D_arrow 0
#define D_bad_respawn_point 1
#define D_cactus 2
#define D_campfire 3
#define D_cramming 4
#define D_dragon_breath 5
#define D_drown 6
#define D_dry_out 7
#define D_ender_pearl 8
#define D_explosion 9
#define D_fall 10
#define D_falling_anvil 11
#define D_falling_block 12
#define D_falling_stalactite 13
#define D_fireball 14
#define D_fireworks 15
#define D_fly_into_wall 16
#define D_freeze 17
#define D_generic 18
#define D_generic_kill 19
#define D_hot_floor 20
#define D_in_fire 21
#define D_in_wall 22
#define D_indirect_magic 23
#define D_lava 24
#define D_lightning_bolt 25
#define D_mace_smash 26
#define D_magic 27
#define D_mob_attack 28
#define D_mob_attack_no_aggro 29
#define D_mob_projectile 30
#define D_on_fire 31
#define D_out_of_world 32
#define D_outside_border 33
#define D_player_attack 34
#define D_player_explosion 35
#define D_sonic_boom 36
#define D_spear 37
#define D_spit 38
#define D_stalagmite 39
#define D_starve 40
#define D_sting 41
#define D_sweet_berry_bush 42
#define D_thorns 43
#define D_thrown 44
#define D_trident 45
#define D_unattributed_fireball 46
#define D_wind_charge 47
#define D_wither 48
#define D_wither_skull 49

// 方块ID扩展
#define B_netherite_block 255

#endif
